Revit 2026 API

# EdgeArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public EdgeArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
EdgeArrayIterator()
```
```fsharp
new : unit -> EdgeArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

EdgeArrayIterator Class

Autodesk.Revit.DB Namespace